Revit 2027 API
Material.StructuralAssetId Property
 The ElementId of the structural PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId StructuralAssetId { get; set; }
Public Property StructuralAssetId As ElementId
	Get
	Set
public:
property ElementId^ StructuralAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member StructuralAssetId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace